package ex1_string;

public class Ex3_String {
	public static void main(String[] args) {
		
//		키보드에서 아무 값이나 무작위로 문장을 입력받는다.
//		입력받은 문자열에 소문자 a가 몇 개 있는지를 판별하는 로직을 구현해보자.
//
//		결과 : 
//		입력 : asdfasdf
//		a의 갯수 : 2
		
//--------------------------------------------------
		
//		회문수 구하기.
//		회문수란 앞으로 읽어도 뒤로 읽어도 똑같이 읽히는 숫자를 말합니다. 
//		예를들어 12121과 같은 숫자.
//		키보드에서 아무값이나 입력받은 후 해당 값이 회문수인지 아닌지를 판단하는 로직(코드)을 구현하자.
//
//		결과 : 
//		입력 : 123
//		123은(는) 회문수가 아닙니다.
//
//		or
//
//		입력 : a12321a
//		a12321a은(는) 회문수 입니다.		
				
	}//main
}






